{
  "hero_title": "RENATO VELUDO",
  "hero_subtitle": "Developer FullStack | Personal Portfolio",
  "about_title": "About Me",
  "about_paragraph_1": "I'm a full stack developer driven by curiosity and a constant desire to learn. Since I was very young, technology has fascinated me, but over time — and after many challenges in life — I discovered that my true passion lies in creating solutions that connect people, simplify routines, and tell stories.",
  "about_paragraph_2": "Graduated in Information Systems since 2003, I took a different path and chose to deepen my knowledge in the administrative sector. Recently, I completed an intensive bootcamp at Mate Academy, where I developed complete projects focused on JavaScript, React, TypeScript, API consumption, and best practices in interface and accessibility. It was a turning point that showed me it's never too late to reinvent yourself with purpose.",
  "about_paragraph_3": "Outside of code, I carry a passion for imaginary worlds. I've been a tabletop RPG game master for over 20 years and am a big fan of anime, movies, series, and PC games — where creativity, strategy, and storytelling constantly inspire me to think outside the box. I believe this directly influences my work as a developer: more than just code, I strive to deliver experiences built with empathy and a user's perspective.",
  "about_paragraph_4": "I'm always seeking evolution, both technically and personally. I believe in purposeful technology, human-centered design, and collaboration as the engine of innovation. This portfolio is more than a showcase — it reflects my commitment to continuous improvement and everything I do with heart.",
  "tech_title": "Technologies",
  "tech_desc1": "Foundation for building web interfaces, focusing on structure, style, and responsiveness.",
  "tech_desc2": "Language that brings pages to life with interactivity, logic, and dynamics.",
  "tech_desc3": "JavaScript library for creating modern, reactive interfaces with reusable components.",
  "tech_desc4": "A superset of JavaScript with static typing, making maintenance and scalability easier.",
  "tech_desc5": "Robust framework for developing large-scale web applications with MVC architecture.",
  "tech_desc6": "Version control with Git and terminal commands for automation and productivity.",
  "tech_desc7": "Management of relational databases, including queries, insertions, and data structuring.",
  "tech_desc8": "JavaScript runtime environment for backend development, ideal for APIs and scalable servers.",
  "tech_desc9": "Progressive framework for building user interfaces with simplicity and high performance.",
  "tech_desc10": "Web fundamentals including how the internet works, protocols, and essential principles.",
  "certificate": "View Certificates",
  "projects_title": "Projects",
  "project_1_desc": "Responsive page using advanced HTML and CSS techniques.",
  "project_2_desc": "Classic game built with JavaScript and advanced logic.",
  "project_3_desc": "Simulated online store using React, with favorites and cart features.",
  "project_4_desc": "Ticket reservation system with both frontend and backend.",
  "portifolio_title": "Personal Portfolio",
  "project_5_desc": "Responsive personal portfolio, multilingual, and focused on user experience.",
  "appMobile_title": "Mobile Application",
  "project_6_desc": "Mobile platform in development focused on personal, family, and group organization.", 
  "contact_title": "Contact",
  "rights_reserved": "All rights reserved.",
  "back_to_top": "Back to top"
}
