{
  "hero_title": "RENATO VELUDO",
  "hero_subtitle": "Desenvolvedor FullStack | Portfólio Pessoal",
  "about_title": "Sobre Mim",
  "about_paragraph_1": "Sou um desenvolvedor full stack movido pela curiosidade e pela vontade constante de aprender. Desde muito jovem, a tecnologia me fascinou, mas foi com o tempo — e muitas batalhas enfrentadas ao longo da vida — que entendi que minha verdadeira paixão está em criar soluções que conectam pessoas, simplificam rotinas e contam histórias.",
  "about_paragraph_2": "Formado em Sistemas de Informação desde 2003, percorri um caminho um pouco diferente e optei por expandir conhecimento no setor administrativo. Recentemente, mergulhei em um bootcamp intensivo pela Mate Academy, onde desenvolvi projetos completos com foco em JavaScript, React, TypeScript, consumo de APIs e boas práticas de interface e acessibilidade. Foi um divisor de águas que me mostrou que nunca é tarde para se reinventar com propósito.",
  "about_paragraph_3": "Fora do código, carrego comigo uma paixão por mundos imaginários. Sou mestre de RPG de mesa há mais de 20 anos e fã declarado de animes, filmes, séries e jogos — onde a criatividade, a estratégia e a narrativa sempre me inspiraram a pensar fora da caixa. Acredito que isso influencia diretamente no meu trabalho como desenvolvedor: mais do que códigos, entrego experiências pensadas com empatia e visão de quem também é usuário.",
  "about_paragraph_4": "Estou sempre em busca de evolução, tanto técnica quanto pessoal. Acredito na tecnologia com propósito, no design centrado no ser humano e na colaboração como motor de inovação. Este portfólio é mais do que uma vitrine — é um reflexo do meu compromisso com a melhoria contínua e com tudo aquilo que faço com o coração.",
  "tech_title": "Tecnologias",
  "tech_desc1": "Base para construção de interfaces web, com foco em estrutura, estilo e responsividade.",
  "tech_desc2": "Linguagem que dá vida às páginas com interatividade, lógica e dinamismo.",
  "tech_desc3": "Biblioteca JavaScript para criar interfaces modernas e reativas com componentes reutilizáveis.",
  "tech_desc4": "Superset do JavaScript com tipagem estática, facilitando a manutenção e escalabilidade.",
  "tech_desc5": "Framework robusto para desenvolvimento de aplicações web em larga escala com estrutura MVC.",
  "tech_desc6": "Controle de versões com Git e comandos via terminal para automação e produtividade.",
  "tech_desc7": "Gerenciamento de bancos de dados relacionais, consultas, inserções e estruturação de dados.",
  "tech_desc8": "Ambiente de execução JavaScript no backend, ideal para APIs e servidores escaláveis.",
  "tech_desc9": "Framework progressivo para criação de interfaces com foco em simplicidade e desempenho.",
  "tech_desc10": "Fundamentos da web, incluindo funcionamento da internet, protocolos e princípios essenciais.",
  "certificate": "Ver Certificados",
  "projects_title": "Projetos",
  "project_1_desc": "Página responsiva com técnicas avançadas de HTML e CSS.",
  "project_2_desc": "Clássico jogo utilizando JavaScript com lógica avançada.",
  "project_3_desc": "Loja virtual simulada com React, favoritos e carrinho.",
  "project_4_desc": "Sistema de reservas de ingressos com frontend e backend. (Apenas para desktop)",
  "portifolio_title": "Portfólio Pessoal",
  "project_5_desc": "Portfólio pessoal responsivo, multilíngue e com foco na experiência do usuário.",
  "appMobile_title": "Aplicativo Mobile",
  "project_6_desc":"Plataforma mobile em desenvolvimento voltada para organização pessoal, familiar e de grupos.",
  "contact_title": "Contato",
  "rights_reserved": "Todos os direitos reservados.",
  "back_to_top": "Voltar ao topo"
}
